// 주석(Comment): 컴파일 X, 노트정리

// 바이트(Byte): 정보의 최소 단위
//  ㄴ 8 bit = 1 byte
//  ㄴ bit = 0 or 1
//  ㄴ 모든 프로그래밍 언어는 값을 Byte로 표현
//  ㄴ C언어는 int(정수) -> 4 Byte 표현
//  ㄴ 1 Byte = 2^8 = 0~255 (256 표현)
//  ㄴ 값을 표현할 때 큰 Byte를 할당하면 할수록 값의 범위도 커짐

// 문자 컴파일
//  ㄴ 문자 → 2진수 형태의 ASCII 코드로 변환
//  ㄴ ex) 'A' → 65
//  ㄴ 문자는 소스코드에서만 문자로 표현되고, 컴퓨터 안에서는 정수와 같은 방식으로 처리

// ASCII 코드
//  ㄴ 사람이 사용하는 기호를 컴퓨터 안에서 표현하는 방법
//  ㄴ http://www.ascii-codes.com/

// 문자 표현 방식
//  ㄴ UTF8(한글표현) 
//  ㄴ 일반적으로 영어 알파벳은 2 Byte 표현
//  ㄴ 일반적으로 한글은 3 Byte 표현